Revit 2027 API
RepeaterCoordinates.DimensionCount Property
 The number of dimensions of the coordinates (0, 1 or 2 for zero, one or two dimensional arrays.)
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int DimensionCount { get; }
Public ReadOnly Property DimensionCount As Integer
	Get
public:
property int DimensionCount {
	int get ();
}
member DimensionCount : int with get
Property Value
Int32
See Also
Reference
RepeaterCoordinates Class
Autodesk.Revit.DB Namespace